
# Тест по работе с символьными строками в 

### 1. В программе используется символьная строка `s`:
```

s = "Hello"
Отметьте все правильные операторы, работающие с этой символьной строкой:

 s = "Hello"

 "Hello" = s

 s[3] = "x"

 s1 = s[1:]

 s[:] = s1
 ```

2. Что будет выведено на экран после выполнения программы?
```
s = "abc"
s = s + "xyz" + s
s = s + s
print(s)
Ответ:
[Введите строку]
```
3. Что будет выведено на экран после выполнения этой программы?
```
s = "abc"
s = s + s[1] + s + s[2]
print(s)
Ответ:
[Введите строку]
```
4. Что будет выведено на экран после выполнения этой программы?
```
s = "abcdef"
n = len(s) + len("123")
print(n)
Ответ:
[Введите число]
```
5. Что будет выведено на экран после выполнения программы?
```
s = "abcdefghi"
s1 = "xyz"
s = s[2:5] + "0" + s1[1:3]
print(s)
Ответ:
[Введите строку]
```
6. Что будет выведено на экран после выполнения этой программы?
```
s = "01234567"
q = "abc"
s = s[:3] + s[6:]
q = q[0] + s + q[2:]
print(q)
Ответ:
[Введите строку]
```
7. Что будет выведено на экран после окончания работы программы?
```
s = "0123456789"
q = s[3:]
n = q.find("5")
print(n)
Ответ:
[Введите число]
```
8. Что будет выведено на экран после выполнения этой программы?
```
s = "0123456789"
n = s.find("345")
q = s[:n+3] + s[n+6:]
print(q)
Ответ:
[Введите строку]
```
9. Сколько единиц будет выведено на экран?
```
s = "123456789"
while len(s) > 0:
    s = s[3:]
    print("1", end="")
Ответ:
[Введите число]
```
10. В программе используется символьная строка s:

s = "I love "
Отметьте все правильные операторы, работающие с этой строкой:
```

 s = "Learning !"

 "Learning !" = s

 s[2] = "X"

 s1 = s[5:10]

 s[3:] = s1
```
11. Что будет выведено на экран после выполнения программы?
```
s = "hello"
s = s + " world" + s
s = s + s
print(s)
Ответ:
[Введите строку]
```
12. Что будет выведено на экран после выполнения этой программы?
```
s = "hello"
s = s + s[2] + s + s[1]
print(s)
Ответ:
[Введите строку]
```
13. Что будет выведено на экран после выполнения этой программы?
```
s = "abcdefg"
n = len(s) + len("ghijk")
print(n)
Ответ:
[Введите число]
```
14. Что будет выведено на экран после выполнения программы?
```
s = "hello world"
s1 = "abc"
s = s[0:5] + "0" + s1[1:3]
print(s)
Ответ:
[Введите строку]
```
15. Что будет выведено на экран после выполнения этой программы?
```
s = "abcdefg"
q = "xyz"
s = s[:3] + s[4:]
q = q[0] + s + q[2:]
print(q)
Ответ:
[Введите строку]
```
16. Что будет выведено на экран после окончания работы программы?
```
s = "abcdef"
q = s[2:]
n = q.find("d")
print(n)
Ответ:
[Введите число]
```
17. Что будет выведено на экран после выполнения этой программы?
```
s = "hello world"
n = s.find("world")
q = s[:n+5] + s[n+6:]
print(q)
Ответ:
[Введите строку]
```
18. Сколько единиц будет выведено на экран?
```
s = "abcdefg"
while len(s) > 0:
    s = s[3:]
    print("1", end="")
Ответ:
[Введите число]
```
19. В программе используется строка s:

s = "I am learning !"
Отметьте все правильные операторы:
```
 s = "Learning !"

 "Learning !" = s

 s[2] = "X"

 s1 = s[5:10]

 s[3:] = s1
```
20. Что будет выведено на экран после выполнения этой программы?
```
s = "test string"
s = s + "abc" + s
s = s + s
print(s)
Ответ:
[Введите строку]
```